{
  "artery_name": "AICA (Anteroinferior Cerebellar Artery)",
  "overview": {
    "summary": "The AICA courses through the central cerebellopontine angle near the facial and vestibulocochlear nerves, arising from the basilar artery and encircling the pons to supply the petrosal cerebellar surface, middle cerebellar peduncle, and cerebellopontine fissure. It is intimately related to the internal auditory meatus and gives rise to critical nerve-related branches including the labyrinthine artery.",
    "key_points": [
      "Courses through cerebellopontine angle near cranial nerves VII and VIII",
      "Commonly bifurcates into rostral and caudal trunks near facial-vestibulocochlear nerve complex",
      "Gives rise to labyrinthine, recurrent perforating, and subarcuate arteries",
      "Supplies petrosal cerebellar surface, middle cerebellar peduncle, and brainstem perforators",
      "Origin most commonly from lower half of basilar artery, frequently asymmetric"
    ]
  },
  "slides": [
    {
      "slide_number": 1,
      "title": "AICA: Anatomical Overview",
      "key_sentence": "AICA is the central cerebellar artery of the pontine angle",
      "detailed_notes": "The anteroinferior cerebellar artery (AICA) courses through the central part of the cerebellopontine angle in intimate relationship with the facial and vestibulocochlear nerves. It may be exposed in surgical approaches to the cerebellopontine angle, basilar or vertebral arteries, clivus, fourth ventricle and cerebellum, and during approaches through the temporal and occipital bones. The AICA is intimately related to the pons, lateral recess, foramen of Luschka, cerebellopontine fissure, middle cerebellar peduncle, and petrosal cerebellar surface.",
      "anatomical_concepts": [
        "Cerebellopontine angle relationship",
        "Facial and vestibulocochlear nerve proximity",
        "Petrosal surface supply"
      ],
      "surgical_relevance": "Critical landmark in cerebellopontine angle surgery; must be identified and preserved in acoustic neuroma resection and other CPA surgeries",
      "suggested_images": [
        "Lateral view of brainstem showing AICA course through CPA",
        "Relationship to cranial nerves VII and VIII"
      ],
      "rhoton_image_refs": ["Fig. 2.5", "Fig. 2.11"]
    },
    {
      "slide_number": 2,
      "title": "AICA Origin and Course",
      "key_sentence": "AICA originates from basilar artery and encircles the pons",
      "detailed_notes": "The AICA originates from the basilar artery, usually as a single trunk, and encircles the pons near the abducent, facial, and vestibulocochlear nerves. After coursing near and sending branches to the nerves entering the acoustic meatus and to the choroid plexus protruding from the foramen of Luschka, it passes around the flocculus on the middle cerebellar peduncle to supply the lips of the cerebellopontine fissure and the petrosal surface. In 72% of cases it arises as a single trunk, 26% as duplicate arteries, and 2% as triplicate arteries. Most commonly arises from the lower half of the basilar artery with frequent side-to-side asymmetry.",
      "anatomical_concepts": [
        "Basilar artery origin (usually lower half)",
        "Relationship to CN VI, VII, VIII",
        "Flocculus and middle cerebellar peduncle course"
      ],
      "surgical_relevance": "Variable origin level affects surgical exposure approach; asymmetry must be anticipated in bilateral pathology",
      "suggested_images": [
        "Anterior view showing AICA origin from basilar artery",
        "Course around pons demonstrating relationship to abducens nerve"
      ],
      "rhoton_image_refs": ["Fig. 2.2", "Fig. 2.3", "Fig. 2.11"]
    },
    {
      "slide_number": 3,
      "title": "AICA Segments: Overview",
      "key_sentence": "AICA divided into four segments based on anatomical relationships",
      "detailed_notes": "The AICA is divided into four segments: 1) Anterior pontine - between clivus and pons belly, begins at origin and ends at level of inferior olive; 2) Lateral pontine - passes through cerebellopontine angle in relation to CN VII/VIII and internal auditory meatus; 3) Flocculopeduncular - passes around flocculus to reach middle cerebellar peduncle; 4) Cortical - supplies predominantly petrosal surface. Each segment may include more than one trunk, depending on the level of bifurcation.",
      "anatomical_concepts": [
        "Four-segment classification system",
        "Anatomical landmarks for segment boundaries",
        "Variable number of trunks per segment"
      ],
      "surgical_relevance": "Segment classification guides surgical approach selection and helps predict arterial location during dissection",
      "suggested_images": [
        "Schematic diagram showing four AICA segments",
        "Color-coded segments on anatomical specimen"
      ],
      "rhoton_image_refs": ["Fig. 2.1"]
    },
    {
      "slide_number": 4,
      "title": "Anterior Pontine Segment",
      "key_sentence": "First segment lies between clivus and pons belly",
      "detailed_notes": "This segment, located between the clivus and the belly of the pons, begins at the origin and ends at the level of a line drawn through the long axis of the inferior olive and extending upward on the pons. This segment usually lies in contact with the rootlets of the abducent nerve (CN VI). It represents the initial course of the artery as it begins its journey around the pons.",
      "anatomical_concepts": [
        "Clivus-pons interval",
        "Inferior olive as landmark",
        "Abducent nerve relationship"
      ],
      "surgical_relevance": "Accessible through anterior skull base approaches; must protect CN VI during dissection",
      "suggested_images": [
        "Anterior view showing AICA at origin with CN VI",
        "Cross-sectional view demonstrating clivus-pons relationship"
      ],
      "rhoton_image_refs": ["Fig. 2.12"]
    },
    {
      "slide_number": 5,
      "title": "Lateral Pontine Segment: Meatal Relationships",
      "key_sentence": "Lateral segment intimately related to internal acoustic meatus and nerves",
      "detailed_notes": "This segment begins at the anterolateral margin of the pons and passes through the cerebellopontine angle above, below, or between the facial and vestibulocochlear nerves. It is intimately related to the internal auditory meatus, lateral recess, and choroid plexus protruding from the foramen of Luschka. This segment is divided into premeatal, meatal, and postmeatal parts based on relationship to the porus of the internal acoustic meatus. These nerve-related branches include the labyrinth artery (supplies CN VII/VIII and inner ear), recurrent perforating arteries (supply brainstem), and subarcuate artery (enters subarcuate fossa). This segment not uncommonly dips below the pontomedullary junction, especially if tortuous.",
      "anatomical_concepts": [
        "Premeatal, meatal, postmeatal subdivision",
        "Three-way relationship to facial-vestibulocochlear nerve complex",
        "Lateral recess and foramen of Luschka proximity"
      ],
      "surgical_relevance": "Most critical segment in CPA surgery; nerve-related branches must be preserved to avoid hearing loss and facial paralysis",
      "suggested_images": [
        "Magnified view of meatal segment relationship to CN VII/VIII",
        "Diagram showing premeatal, meatal, postmeatal divisions"
      ],
      "rhoton_image_refs": ["Fig. 2.5", "Fig. 2.11", "Fig. 2.12"]
    },
    {
      "slide_number": 6,
      "title": "AICA Bifurcation Pattern",
      "key_sentence": "AICA typically bifurcates into rostral and caudal trunks",
      "detailed_notes": "Single trunk AICAs usually bifurcate into rostral and caudal trunks, with approximately two-thirds bifurcating before and one-third after crossing the facial-vestibulocochlear nerves. The rostral trunk courses laterally above the flocculus to reach the middle cerebellar peduncle and petrosal fissure, supplying the superior lip of the cerebellopontine fissure and adjoining petrosal surface. The caudal trunk courses caudal to flocculus to supply the inferior petrosal surface including flocculus and choroid plexus. Duplicate AICAs (26% of cases) are termed rostral and caudal duplicate AICAs with distribution similar to post-bifurcation trunks. Distal branches of caudal trunk anastomose with PICA; rostral trunk branches anastomose with SCA.",
      "anatomical_concepts": [
        "Rostral vs caudal trunk distribution",
        "Pre-nerve vs post-nerve bifurcation patterns",
        "Anastomoses with PICA and SCA"
      ],
      "surgical_relevance": "Understanding bifurcation pattern critical for predicting vascular anatomy during tumor removal; rostral trunk preservation important for cerebellar peduncle perfusion",
      "suggested_images": [
        "Bifurcation diagram showing rostral and caudal trunks",
        "Specimen showing pre-nerve and post-nerve bifurcation examples"
      ],
      "rhoton_image_refs": ["Fig. 2.11"]
    },
    {
      "slide_number": 7,
      "title": "Premeatal Segment",
      "key_sentence": "Premeatal segment courses from origin to anterior meatal edge",
      "detailed_notes": "This segment begins at the basilar artery and courses around the brainstem to reach the facial and vestibulocochlear nerves and the anterior edge of the meatus. In 88% of CPAs there is a solitary premeatal segment, and 12% have double segments composed of one or two arterial trunks. The majority (46 of 56 segments examined) were anteroinferior to the nerves. The remainder were anterior, inferior, or anterosuperior to the nerves. This segment gives rise to many of the important nerve-related branches.",
      "anatomical_concepts": [
        "Basilar origin to meatal entrance",
        "Most commonly anteroinferior to CN VII/VIII",
        "Single vs double segment patterns"
      ],
      "surgical_relevance": "First segment encountered during retrosigmoid approach to CPA; identification guides subsequent dissection",
      "suggested_images": [
        "Lateral view showing premeatal segment course",
        "Statistical diagram of segment positions relative to nerves"
      ],
      "rhoton_image_refs": ["Fig. 2.14"]
    },
    {
      "slide_number": 8,
      "title": "Meatal Segment and Loops",
      "key_sentence": "Meatal segment forms loop toward or into the meatus",
      "detailed_notes": "This segment, located in the vicinity of the internal auditory meatus, often forms a laterally convex loop (the medial loop) directed toward or through the meatus. In 82% of CPAs there is one meatal segment, and 18% have two segments. The segment is medial to the porus in about half of cases and forms a loop reaching the porus or protruding into the canal in the other half. Studies show meatal segment at porus or within canal in 64-67% of CPAs, reaching up to the medial half of the canal. The majority course below or between facial and vestibulocochlear nerves. Most loops course in horizontal plane above or below nerves, but some (especially those between nerves) course in vertical or oblique plane.",
      "anatomical_concepts": [
        "Medial loop formation",
        "Porus entry in 50% of cases",
        "Horizontal vs vertical loop orientations"
      ],
      "surgical_relevance": "Loop entering meatus is at risk during internal auditory canal drilling; must be identified before bone removal to prevent injury and hearing loss",
      "suggested_images": [
        "Meatal loop entering porus acusticus",
        "Variations in loop relationship to CN VII/VIII"
      ],
      "rhoton_image_refs": ["Fig. 2.11D", "Fig. 2.12", "Fig. 2.14"]
    },
    {
      "slide_number": 9,
      "title": "Subarcuate Loop",
      "key_sentence": "Secondary loop creates 'M' configuration toward subarcuate fossa",
      "detailed_notes": "In some CPAs, the nerve-related loop forms a second laterally convex curve that gives the loop an 'M' configuration. This second loop is called the subarcuate loop because it is directed toward the subarcuate fossa, a small depression in the bone superolateral to the meatus. This loop is located either posterior, posteroinferior, or posterosuperior to the vestibulocochlear nerve. The apex of the loop is occasionally adherent to the dura over the subarcuate fossa at the point where the subarcuate artery arises. This represents an additional complexity in the already variable AICA anatomy.",
      "anatomical_concepts": [
        "'M' configuration of double loop",
        "Subarcuate fossa as target",
        "Dural adherence at subarcuate artery origin"
      ],
      "surgical_relevance": "Subarcuate loop adherence to dura requires careful dissection to avoid avulsion injury; important in translabyrinthine approaches",
      "suggested_images": [
        "Lateral view showing M-shaped double loop",
        "Subarcuate fossa location on petrous bone"
      ],
      "rhoton_image_refs": ["Fig. 2.13"]
    },
    {
      "slide_number": 10,
      "title": "Postmeatal Segment",
      "key_sentence": "Final meatal segment courses medially to brainstem and cerebellum",
      "detailed_notes": "This segment begins distal to the nerves and courses medially to supply the brainstem and cerebellum. In 80% of CPAs there is one postmeatal segment, and 20% have two segments. The postmeatal segments are most commonly posteroinferior, superior, or posterior to or between the nerves; notably, none are anterior to the nerves. Each vessel in a double segment configuration may pursue similar or separate courses relative to the nerves. This segment represents the transition from the nerve-related portion to the cerebellar distribution territory.",
      "anatomical_concepts": [
        "Post-nerve to cerebellar course",
        "Posterior or superior to nerves (never anterior)",
        "Transition to cerebellar supply"
      ],
      "surgical_relevance": "Safe zone for dissection as it is distal to critical nerve-related branches; entry point to cerebellar exposure",
      "suggested_images": [
        "Postmeatal segment coursing to cerebellum",
        "Relationship diagram showing positions relative to nerves"
      ],
      "rhoton_image_refs": ["Fig. 2.14"]
    },
    {
      "slide_number": 11,
      "title": "Labyrinthine (Internal Auditory) Artery",
      "key_sentence": "Labyrinthine artery supplies inner ear and CN VII/VIII",
      "detailed_notes": "These arteries are branches of AICA that enter the internal auditory canal and supply the bone and dura lining the canal, nerves within the canal, and terminate by giving rise to vestibular, cochlear, and vestibulocochlear arteries supplying the inner ear organs. One internal auditory artery in 30% of CPAs, two in 54%, three in 14%, and four in 2%. Of 94 internal auditory arteries studied: 77% originated from premeatal segment, 21% from meatal segment, 2% from postmeatal segment. They arise proximal to subarcuate loop when present. 54% originate from solitary AICA, 23% from duplicate/triplicate AICA, 23% from recurrent perforating artery. Almost always arise from AICA (not basilar), though some studies report up to 17% basilar origin (definition differences).",
      "anatomical_concepts": [
        "Inner ear vascular supply",
        "Multiple arteries in 70% of cases",
        "Predominantly premeatal origin"
      ],
      "surgical_relevance": "Preservation critical for hearing preservation in acoustic neuroma surgery; injury causes sudden sensorineural hearing loss and vestibular dysfunction",
      "suggested_images": [
        "Labyrinthine artery entering internal auditory canal",
        "Branching pattern within meatus to cochlear/vestibular divisions"
      ],
      "rhoton_image_refs": ["Fig. 2.12", "Fig. 2.13", "Fig. 2.14"]
    },
    {
      "slide_number": 12,
      "title": "Recurrent Perforating Arteries",
      "key_sentence": "Recurrent perforators loop toward meatus then return to brainstem",
      "detailed_notes": "These perforating arteries arise from nerve-related vessels and often travel from their origin toward the meatus, occasionally looping into the meatus before taking a recurrent course along CN VII/VIII to reach the brainstem. They send branches to these nerves and to brainstem surrounding the entry zone. They also supply (in decreasing frequency): middle cerebellar peduncle and adjacent pons, pons around trigeminal nerve entry, choroid plexus of CPA, superolateral medulla, and CN IX/X. Give rise to ~25% of labyrinthine arteries and 10% of subarcuate arteries. Present in 82% of CPAs (74% one artery, 6% two arteries, 2% three arteries). Most arise from premeatal segment but also from meatal loop and postmeatal segment. Most originate inferior, anteroinferior, or anterior to or between nerves and course medially between or above/below nerves.",
      "anatomical_concepts": [
        "Recurrent course pattern",
        "Brainstem perforator supply",
        "CN VII/VIII vasa nervorum contribution"
      ],
      "surgical_relevance": "Must be preserved to prevent lateral pontine infarction; variable course makes identification challenging during dissection",
      "suggested_images": [
        "Recurrent course from meatus back to brainstem",
        "Perforating branches entering lateral pons"
      ],
      "rhoton_image_refs": ["Fig. 2.5", "Fig. 2.14"]
    },
    {
      "slide_number": 13,
      "title": "Subarcuate Artery",
      "key_sentence": "Subarcuate artery enters petrous bone via subarcuate fossa",
      "detailed_notes": "The subarcuate artery usually originates medial to porus, penetrates dura covering subarcuate fossa, and enters the subarcuate canal. In a few cases, originates within internal auditory canal; those taking recurrent course through porus or penetrating meatal wall to reach subarcuate canal. Supplies petrous bone in region of semicircular canals. Subarcuate canal is recognized route of infection extension from mastoid to meninges and superior petrosal sinus. AICA adherent to dura lining subarcuate fossa at artery origin in some CPAs. Present in 72% of CPAs: 26% originate from premeatal segment, 4% from meatal segment, 42% from postmeatal segment. Most originate posterior and course posterosuperior to nerves. Those originating anterior/inferior cross inferior to CN VII/VIII to reach fossa.",
      "anatomical_concepts": [
        "Subarcuate fossa penetration",
        "Petrous bone vascular supply",
        "Semicircular canal region supply"
      ],
      "surgical_relevance": "At risk during translabyrinthine approach; connection to superior petrosal sinus explains risk of venous complications with infection",
      "suggested_images": [
        "Subarcuate artery entering subarcuate fossa",
        "Petrous bone anatomy showing subarcuate canal"
      ],
      "rhoton_image_refs": ["Fig. 2.13", "Fig. 2.14"]
    },
    {
      "slide_number": 14,
      "title": "Cortical Branches and Territory",
      "key_sentence": "AICA supplies majority of petrosal cerebellar surface",
      "detailed_notes": "Most common pattern: AICA supplies majority of petrosal surface, but cortical area highly variable. Can vary from small area on flocculus and adjacent petrosal surface to entire petrosal surface plus adjacent tentorial and suboccipital surfaces. After crossing nerves, rostral trunk usually courses above flocculus to superior lip of cerebellopontine fissure; caudal trunk courses caudal to flocculus to supply inferior petrosal surface. If PICA absent, caudal trunk may supply almost all ipsilateral suboccipital hemisphere and vermis. Overlap of SCA onto upper petrosal surface and PICA onto lateral suboccipital surface not uncommon. This variability reflects reciprocal relationship between cerebellar arteries.",
      "anatomical_concepts": [
        "Petrosal surface as primary territory",
        "Rostral vs caudal trunk distributions",
        "Compensatory expansion with PICA absence"
      ],
      "surgical_relevance": "Variable territory affects stroke risk with sacrifice; must assess PICA and SCA territories before considering AICA sacrifice",
      "suggested_images": [
        "Cerebellar surface showing typical AICA territory",
        "Variations in cortical distribution with PICA hypoplasia"
      ],
      "rhoton_image_refs": ["Fig. 2.11"]
    },
    {
      "slide_number": 15,
      "title": "AICA Occlusion Syndromes",
      "key_sentence": "AICA occlusion causes lateral brainstem and CN VII/VIII dysfunction",
      "detailed_notes": "Occlusion results in syndromes related predominantly to softening of lateral brainstem and cerebellar peduncles rather than cerebellar hemisphere. Manifestations include: CN VII/VIII palsies (facial paralysis, deafness) from nerve and nuclear involvement; vertigo, nausea, vomiting, nystagmus from vestibular nuclear lesions and vagal connections; ipsilateral facial pain/temperature loss and corneal hypesthesia from spinal trigeminal tract/nucleus interruption; Horner's syndrome from descending pupillodilator fiber interruption in lateral pons/medulla; cerebellar ataxia and asynergia from peduncular lesions; incomplete contralateral body pain/temperature loss (extreme lateral/posterior lesion position spares part of spinothalamic tract). Symptoms sudden onset without loss of consciousness; vertigo most prominent, followed by facial paralysis, deafness, sensory loss, cerebellar signs. Notable absence of corticospinal tract and medial lemniscus signs (nourished by midline vertebrobasilar perforators).",
      "anatomical_concepts": [
        "Lateral pontine syndrome components",
        "Nerve vs nuclear dysfunction",
        "Sparing of medial structures"
      ],
      "surgical_relevance": "Understanding syndrome helps identify at-risk structures during surgery; guides decision-making regarding vessel sacrifice vs preservation",
      "suggested_images": [
        "Cross-section showing AICA vascular territory on pons",
        "Clinical photo of facial paralysis from AICA stroke"
      ],
      "rhoton_image_refs": []
    },
    {
      "slide_number": 16,
      "title": "Collateral Circulation and Surgical Tolerance",
      "key_sentence": "AICA occlusion often tolerated due to PICA and SCA anastomoses",
      "detailed_notes": "Recovery and survival of many patients after intentional AICA occlusion at operation attributed to adequacy of collateral circulation from other cerebellar arteries. Infarction size after AICA occlusion inversely related to PICA and SCA size and anastomoses with those arteries. If PICA unusually small and AICA large, collateral circulation likely poor, creating unfavorable and dangerous situation for AICA occlusion. Arterial spasm from mechanical irritation by brain retractor during tumor removal may render collateral supply less effective. This anatomical variability explains why some patients tolerate AICA sacrifice while others develop devastating strokes.",
      "anatomical_concepts": [
        "Anastomotic connections with PICA and SCA",
        "Reciprocal arterial sizing",
        "Collateral flow capacity"
      ],
      "surgical_relevance": "Preoperative imaging assessment of PICA/SCA size critical when AICA sacrifice considered; avoid retractor-induced vasospasm that compromises collaterals",
      "suggested_images": [
        "Angiogram showing AICA-PICA anastomoses",
        "Diagram illustrating reciprocal arterial sizing patterns"
      ],
      "rhoton_image_refs": []
    },
    {
      "slide_number": 17,
      "title": "Surgical Approaches to AICA",
      "key_sentence": "Multiple approaches access different AICA segments",
      "detailed_notes": "AICA most commonly exposed in cerebellopontine angle tumor operations. Lateral suboccipital (retrosigmoid) approach: excellent for meatal and postmeatal segments, lateral mid/lower brainstem below trigeminal nerve, area near internal acoustic meatus. Subtemporal middle fossa with tentorial division ± medial petrosectomy: for high AICA origin, involvement with SCA/basilar arteries, medial to trigeminal nerve; care needed to protect CN IV between lateral pontomesencephalic segment and tentorial edge. Translabyrinthine: exposes AICA at and short distance proximal/distal to meatus along anterior petrosal surface. Supra-infratentorial presigmoid with variable semicircular canal/vestibule/cochlea resection: for lesions deep in front of brainstem, especially near AICA origin. Anterior clival approaches: expose AICA origin only if near midline, not if basilar artery loops laterally beyond cavernous sinus/petrous carotid limits.",
      "anatomical_concepts": [
        "Segment-specific approach selection",
        "Tentorial relationships",
        "Petrous bone anatomy"
      ],
      "surgical_relevance": "Approach selection based on lesion location and AICA segment involved; high origin may require tentorial division; tortuous basilar may necessitate lateral skull base approach",
      "suggested_images": [
        "Schematic showing approaches and AICA segments accessed",
        "Operative view of AICA through retrosigmoid craniotomy"
      ],
      "rhoton_image_refs": ["Fig. 2.13"]
    }
  ]
}
